In [9]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# For date libraries
from datetime import datetime, date
from dateutil.relativedelta import relativedelta
from math import ceil

In [10]:
item_categories= pd.read_csv('item_categories.csv')
items= pd.read_csv('items.csv')
train= pd.read_csv('sales_train.csv')
shops= pd.read_csv('shops.csv')
test= pd.read_csv('test.csv')
submission= pd.read_csv('sample_submission.csv')

In [11]:
## to see shop id and item of test and train match or not

In [25]:
test_shops= test.shop_id.unique()
trais= train[train.shop_id.isin(test_shop)]
test_items= test.item_id.unique()
train= train[train.shop_id.isin(test_item)]

In [13]:
train.head()

             date  date_block_num  shop_id  item_id  item_price  item_cnt_day
0      02.01.2013               0       59    22154       999.0           1.0
40084  10.01.2013               0       59    22151       399.0           1.0
60142  30.01.2013               0       53    16020       299.0           1.0
60143  03.01.2013               0       31     4906      1794.0           2.0
60144  02.01.2013               0       31     4906      1789.0           1.0

In [21]:
test.head()

   ID  shop_id  item_id
0   0        5     5037
1   1        5     5320
2   2        5     5233
3   3        5     5232
4   4        5     5268

In [26]:
items.head()

,item_name,item_id,item_category_id
0,! ВО ВЛАСТИ НАВАЖДЕНИЯ (ПЛАСТ.) D,0,40
1,!ABBYY FineReader 12 Professional Edition Full...,1,76
2,***В ЛУЧАХ СЛАВЫ (UNV) D,2,40
3,***ГОЛУБАЯ ВОЛНА (Univ) D,3,40
4,***КОРОБКА (СТЕКЛО) D,4,40

In [30]:
items['item_name']= items.drop(['item_name'],axis=1)

In [24]:
shops.head()

                        shop_name  shop_id
0   !Якутск Орджоникидзе, 56 фран        0
1   !Якутск ТЦ "Центральный" фран        1
2                Адыгея ТЦ "Мега"        2
3  Балашиха ТРК "Октябрь-Киномир"        3
4        Волжский ТЦ "Волга Молл"        4

In [32]:
shops['shop_name']= shops.drop(['shop_name'],axis=1)

In [33]:
MAX_BLOCK_NUM = train.date_block_num.max()
MAX_ITEM = len(test_items)
MAX_CAT = len(item_categories)
MAX_YEAR = 3
MAX_MONTH = 4 # 7 8 9 10
MAX_SHOP = len(test_shops)

In [34]:
MAX_SHOP

42

In [35]:
MAX_CAT

84

In [36]:
MAX_BLOCK_NUM

33

In [ ]:
## Data Exploration